# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [1]:
import numpy as np
import pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [2]:
a= pd.Series([100,200,300,400])

Print a, and data type

In [3]:
print(a)
print(type(a))

0    100
1    200
2    300
3    400
dtype: int64
<class 'pandas.core.series.Series'>

Using indexing access the element 300 from the series a.

In [4]:
a[2]

300

What are the values of index for series a?

In [5]:
a.values

array([100, 200, 300, 400], dtype=int64)

Change the index to  ['c', 'a', 'b', 'd']

In [6]:
a.index=['c','a','b','d']

Access the value in the series with index 'd'

In [7]:
a['d']

400

Sort the values wrt to the index and print it

In [8]:
print(a.sort_index())

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [9]:
b = pd.Series(data=[800,450,100],index=['e','f','g'])
print(b)

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [10]:
a.append(b,ignore_index=False)

C:\Users\User\AppData\Local\Temp\ipykernel_9724\785575082.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  a.append(b,ignore_index=False)

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

In [11]:
#print a again after appending b into it
a

c    100
a    200
b    300
d    400
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [12]:
a =a.sort_index(ascending=False) 
a

d    400
c    100
b    300
a    200
dtype: int64

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [13]:
df =pd.DataFrame(data=a)

In [14]:
print(df)

     0
d  400
c  100
b  300
a  200

What is the shape of the datafarme <br>
(also, what does it imply?)

In [15]:
print(df.shape) # 04 rows 1 column

print(df.size)  # 04 rows

(4, 1)
4

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [16]:
# yep its same as the series.

df.index

Index(['d', 'c', 'b', 'a'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [17]:
# top 5
df.head()

     0
d  400
c  100
b  300
a  200

In [18]:
# buttom 5
df.tail()

     0
d  400
c  100
b  300
a  200

Rename the column of the dataframe as 'points'

In [19]:
df.columns=['points']

In [20]:
df

   points
d     400
c     100
b     300
a     200

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [21]:
#Create fruits array

fruits =np.array(['orange','mango','apple','lichi','grapes','coconut','kiwi'])
print(fruits)

['orange' 'mango' 'apple' 'lichi' 'grapes' 'coconut' 'kiwi']

In [22]:
#Create series fruits out of fruits array
fruits =pd.Series(data=fruits)
fruits

0     orange
1      mango
2      apple
3      lichi
4     grapes
5    coconut
6       kiwi
dtype: object

In [23]:
type(fruits)

pandas.core.series.Series

Change the index of fruits to the index of dataframe df

In [24]:
fruits.rename(index=fruits)

orange      orange
mango        mango
apple        apple
lichi        lichi
grapes      grapes
coconut    coconut
kiwi          kiwi
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [25]:
df=pd.DataFrame(data=fruits,columns=['fruits'])
df.head()

   fruits
0  orange
1   mango
2   apple
3   lichi
4  grapes

In [26]:
df.columns

Index(['fruits'], dtype='object')

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [27]:
d1 = pd.DataFrame(data={'city':['Chandigarh', 'Delhi' ,'Kanpur', 'Chennai', 'Manali'],
                 'Temp':[15,22,20,26,-2]})

In [28]:
print(d1)

         city  Temp
0  Chandigarh    15
1       Delhi    22
2      Kanpur    20
3     Chennai    26
4      Manali    -2

In [29]:
d1

         city  Temp
0  Chandigarh    15
1       Delhi    22
2      Kanpur    20
3     Chennai    26
4      Manali    -2

What is the shape of d1.

In [30]:
d1.shape

(5, 2)

Set city = d1['city']

In [31]:
city=d1['city']

print city <br>
What is the type of city.

In [32]:
print(city)

print("\n\nTYPE: ",type(city))

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object


TYPE:  <class 'pandas.core.series.Series'>

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [33]:
d2 =pd.DataFrame(data={"city":['Bengalaru','Coimbatore','Srirangam','Pondicherry'],
                      "Temperature":[24,35,36,39]}) 
d2

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [34]:
print("SHAPE:",d2.shape)

SHAPE: (4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [35]:
d3 =  pd.concat((d1,d2),axis=0,ignore_index=True)
d3

          city  Temp  Temperature
0   Chandigarh  15.0          NaN
1        Delhi  22.0          NaN
2       Kanpur  20.0          NaN
3      Chennai  26.0          NaN
4       Manali  -2.0          NaN
5    Bengalaru   NaN         24.0
6   Coimbatore   NaN         35.0
7    Srirangam   NaN         36.0
8  Pondicherry   NaN         39.0

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [36]:
d3[d3['Temp']<20]['city']

0    Chandigarh
4        Manali
Name: city, dtype: object

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [37]:
d3[d3['Temperature']>35]

          city  Temp  Temperature
7    Srirangam   NaN         36.0
8  Pondicherry   NaN         39.0

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [38]:
# write function here

def is_ut(x):
    for i in x:
        if i in ['Chandigarh', 'Pondicherry', 'Delhi']:
            print(i," :","Union Territories")
        else:
            continue
    
    
# d3['is_ut'] = 

is_ut(d3['city'])

Chandigarh  : Union Territories
Delhi  : Union Territories
Pondicherry  : Union Territories

In [39]:
# print d3
d3

          city  Temp  Temperature
0   Chandigarh  15.0          NaN
1        Delhi  22.0          NaN
2       Kanpur  20.0          NaN
3      Chennai  26.0          NaN
4       Manali  -2.0          NaN
5    Bengalaru   NaN         24.0
6   Coimbatore   NaN         35.0
7    Srirangam   NaN         36.0
8  Pondicherry   NaN         39.0

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [40]:
# write function here

def Cel_to_Fah(x):
        F = (x * 1.8) + 32
        print(F)
    
# convert celsius to Fahrenheit    
Cel_to_Fah(d3['Temp'])

0    59.0
1    71.6
2    68.0
3    78.8
4    28.4
5     NaN
6     NaN
7     NaN
8     NaN
Name: Temp, dtype: float64

In [41]:
# check function c_to_f(10)

Cel_to_Fah(10)

50.0

In [42]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'
tem=[]
for i in d3['Temperature']:
    F = (i * 1.8) + 32
    tem.append(F)
tem

[nan, nan, nan, nan, nan, 75.2, 95.0, 96.8, 102.2]

In [43]:
d3['temp_farenhiet']=tem

In [44]:
Cel_to_Fah(d3['Temp'][0:5])

0    59.0
1    71.6
2    68.0
3    78.8
4    28.4
Name: Temp, dtype: float64

In [45]:
tm=[]
for i in d3['Temp']:
    f=(i*1.8)+32
    tm.append(f)

In [46]:
tm

[59.0, 71.6, 68.0, 78.80000000000001, 28.4, nan, nan, nan, nan]

In [47]:
x=lambda g:(g*1.8)+32
x(10)

50.0

In [48]:
x(10)

50.0

In [49]:
d3

          city  Temp  Temperature  temp_farenhiet
0   Chandigarh  15.0          NaN             NaN
1        Delhi  22.0          NaN             NaN
2       Kanpur  20.0          NaN             NaN
3      Chennai  26.0          NaN             NaN
4       Manali  -2.0          NaN             NaN
5    Bengalaru   NaN         24.0            75.2
6   Coimbatore   NaN         35.0            95.0
7    Srirangam   NaN         36.0            96.8
8  Pondicherry   NaN         39.0           102.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [86]:
d1[(d1['city']=='Chandigarh')]

         city  Temp
0  Chandigarh    15

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

Select only the first three rows of the dataframe d1.

In [100]:
d1.head(3)

         city  Temp
0  Chandigarh    15
1       Delhi    22
2      Kanpur    20

Select all the rows and last two columns in the dataframe.

In [108]:
d1[['city','Temp']]

         city  Temp
0  Chandigarh    15
1       Delhi    22
2      Kanpur    20
3     Chennai    26
4      Manali    -2

## Groupby

In [109]:
# Create a dataframe using dictionary of your choice

df= pd.DataFrame(data={"State":["Delhi","Jharkhand","West Bengal","Orissa","Hydrabad","Assam"],
                      "Players":[5,4,6,8,4,6],
                      "Wins":[10,8,6,8,4,7]})
df

         State  Players  Wins
0        Delhi        5    10
1    Jharkhand        4     8
2  West Bengal        6     6
3       Orissa        8     8
4     Hydrabad        4     4
5        Assam        6     7

In [115]:
# Use Groupby of single column with aggregate sum()

df.groupby(df["State"]).sum()

             Players  Wins
State
Assam              6     7
Delhi              5    10
Hydrabad           4     4
Jharkhand          4     8
Orissa             8     8
West Bengal        6     6

In [117]:
6# Use Groupby/.,m   of single column with aggregate count()
df.groupby(["Wins"]).count()

      State  Players
Wins
4         1        1
6         1        1
7         1        1
8         2        2
10        1        1

In [122]:
# Use Groupby of single column with aggregate min() and max()
print(df.groupby(['Players']).min(),"\n",
     df.groupby(['Players']).max())

            State  Wins
Players
4        Hydrabad     4
5           Delhi    10
6           Assam     6
8          Orissa     8
                State  Wins
Players
4          Jharkhand     8
5              Delhi    10
6        West Bengal     7
8             Orissa     8

In [126]:
# Use Groupby of any 2 columns with aggregate mean()

df.groupby(["Players","State"]).mean()

                     Wins
Players State
4       Hydrabad      4.0
        Jharkhand     8.0
5       Delhi        10.0
6       Assam         7.0
        West Bengal   6.0
8       Orissa        8.0

In [130]:
# Use Groupby of any 2 columns with aggregate min() and max()
df.groupby(['Wins',"State"]).min()

                  Players
Wins State
4    Hydrabad           4
6    West Bengal        6
7    Assam              6
8    Jharkhand          4
     Orissa             8
10   Delhi              5

In [133]:
df.groupby(["Wins","Players"]).max()

                    State
Wins Players
4    4           Hydrabad
6    6        West Bengal
7    6              Assam
8    4          Jharkhand
     8             Orissa
10   5              Delhi

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [ ]:
a =pd.date_range(start='01-01-2020',end='04-01-2021')

print a

In [ ]:
print(a)

What is the len of a?

In [ ]:
len(a)

What is the type of a?

In [ ]:
type(a)